DataProcessors/ЗагрузкаНоменклатурыИзExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаНоменклатурыИзExcel</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиНаименование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиЕдИзм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеКЗагрузке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДляПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АльтернативнаяЕдИзм</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АльтернативнаяЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АльтернативнаяЕдИзмКоэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АльтернативнаяЕдИзмВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Comment>#5951</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗагрузкаНоменклатурыИзExcel/Forms/ЗагрузкаВТабличнуюЧасть/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьСумму = Истина;
	Если Параметры.Свойство("ИспользоватьСумму") Тогда
		ИспользоватьСумму = Параметры.ИспользоватьСумму;
	КонецЕсли;
	
	Элементы.НомерКолонкиСумма.Видимость = ИспользоватьСумму;
	Элементы.ТабЗначСумма.Видимость = ИспользоватьСумму;
	
	ИспользоватьКоличество = Истина;
	Если Параметры.Свойство("ИспользоватьКоличество") Тогда
		ИспользоватьКоличество = Параметры.ИспользоватьКоличество;
	КонецЕсли;
	
	Элементы.НомерКолонкиКоличество.Видимость = ИспользоватьКоличество;
	Элементы.ТабЗначКоличество.Видимость  = ИспользоватьКоличество;
	Элементы.ТабЗначКоэффициент.Видимость = ИспользоватьКоличество;
	
	ИспользоватьСтатьи = Истина;
	Если Параметры.Свойство("ИспользоватьСтатьи") Тогда
		ИспользоватьСтатьи = Параметры.ИспользоватьСтатьи;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ТабЗначСтатьяДоходов");
	МассивЭлементов.Добавить("ТабЗначСтатьяРасходов");
	ФинансыСервер.УстановитьВидимостьКолонокСтатейДиРВТабличнойЧасти(ЭтаФорма, МассивЭлементов);
	
	Для каждого ЭлементФормы из МассивЭлементов Цикл
		Элементы[ЭлементФормы].Видимость = Элементы[ЭлементФормы].Видимость И ИспользоватьСтатьи;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачСтр = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.ПолноеИмяФайла = "";
    ДиалогВыбораФайла.Заголовок = "Выберите файл Excel";
	
	Фильтр =  "Файлы Excel|*.xls;*.xlsx";
	ДиалогВыбораФайла.Фильтр = Фильтр;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
    
    Оповещение_ПослеЗакрытияДиалогаВыбораФайла = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма);
	
	ДиалогВыбораФайла.Показать(Оповещение_ПослеЗакрытияДиалогаВыбораФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ПутьКФайлу = Результат[0]; // ПолноеИмяФайла
    
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)

	ОчиститьСообщения();
	
	Если НомерКолонкиНаименование = 0 И НомерКолонкиАртикул = 0 
		И НомерКолонкиКод = 0 И НомерКолонкиШтрихкод = 0 Тогда
		
		Сообщить("Обязательно должен быть указан один из номеров колонок: ""Артикул"", ""Штрихкод"", ""Код"" или ""Наименование"".");
		Возврат;

	КонецЕсли;

	ТабЗнач.Очистить();
	
	// №14526 делаем чтение через табличный документ, чтобы не требовалась установка Excel + исправление загрузки чисел с различными форматами
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеПомещенияФайлаВоВременноеХранилище", ЭтотОбъект),, ПутьКФайлу, Ложь, УникальныйИдентификатор);
	
	//++ перенесено в ПрочитатьФайлExcel
	//Попытка
	//	ExcelПриложение = Новый COMОбъект("Excel.Application");
	//Исключение
	//	Сообщить("Ошибка работы с Excel." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
	//	Возврат;
	//КонецПопытки;
	//Попытка
	//	Файл = ExcelПриложение.WorkBooks.Open(ПутьКФайлу);
	//Исключение
	//	Сообщить("Ошибка открытия файла." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
	//	Возврат;
	//КонецПопытки;
	//
	//Попытка
	//	Лист = Файл.Sheets(1);
	//	xlCellTypeLastCell = 11;
	//	ПоследняяСтрока = Лист.Cells.SpecialCells(xlCellTypeLastCell).Row;
	//Исключение
	//	Сообщить("Ошибка открытия листа №1." + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
	//	ExcelПриложение.Quit();
	//	Возврат;
	//КонецПопытки;
	//
	//ПоследняяСтрока = ?(КонСтр = 0, ПоследняяСтрока, КонСтр);
	//НачальнаяСтрока = ?(НачСтр = 0, 1, НачСтр);

	//Для Строка = НачальнаяСтрока По ПоследняяСтрока Цикл
	//	Попытка
	//		ЗагружаемоеНаименование = ?(НомерКолонкиНаименование = 0, 	"", СокрЛП(Лист.Cells(Строка, НомерКолонкиНаименование).Text));
	//		ЗагружаемыйАртикул 		= ?(НомерКолонкиАртикул = 0, 		"", СокрЛП(Лист.Cells(Строка, НомерКолонкиАртикул).Text));
	//		ЗагружаемыйКод 			= ?(НомерКолонкиКод = 0, 			"", СокрЛП(Лист.Cells(Строка, НомерКолонкиКод).Text));
	//		ЗагружаемыйШтрихкод 	= ?(НомерКолонкиШтрихкод = 0, 		"", СокрЛП(Лист.Cells(Строка, НомерКолонкиШтрихкод).Text));
	//		
	//		Если ПустаяСтрока(ЗагружаемоеНаименование) И ПустаяСтрока(ЗагружаемыйАртикул)
	//			И ПустаяСтрока(ЗагружаемыйКод) И ПустаяСтрока(ЗагружаемыйШтрихкод) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		 
	//		Стр = ТабЗнач.Добавить();
	//		Стр.Наименование = ЗагружаемоеНаименование;
	//		Стр.ЗагружаемыйАртикул = ЗагружаемыйАртикул;
	//		Стр.ЗагружаемыйКод = ЗагружаемыйКод;
	//		Стр.ЗагружаемыйШтрихкод = ЗагружаемыйШтрихкод;
	//		
	//		Стр.Характеристика = ?(НомерКолонкиХарактеристика = 0, 	"", СокрЛП(Лист.Cells(Строка, НомерКолонкиХарактеристика).Text));
	//		
	//		Стр.ЗагружаемаяЕдиницаИзмерения = ?(НомерКолонкиЕдИзм = 0, 	"", СокрЛП(Лист.Cells(Строка, НомерКолонкиЕдИзм).Text));
	//		
	//		Стр.Количество = ?(НомерКолонкиКоличество = 0, 1, СокрЛП(Лист.Cells(Строка, НомерКолонкиКоличество).Text));
	//		Стр.Цена = ?(НомерКолонкиЦена = 0, 0, СокрЛП(Лист.Cells(Строка, НомерКолонкиЦена).Text));
	//		Стр.Сумма = ?(НомерКолонкиСумма = 0, 0, СокрЛП(Лист.Cells(Строка, НомерКолонкиСумма).Text));
	//		
	//		Если Стр.Цена = 0 И Стр.Сумма > 0 И Стр.Количество <> 0 Тогда
	//			Стр.Цена = Стр.Сумма / Стр.Количество;
	//		КонецЕсли;
	//		Если Стр.Цена > 0 И Стр.Сумма = 0 И Стр.Количество <> 0 И ИспользоватьСумму Тогда
	//			Стр.Сумма = Стр.Цена * Стр.Количество;
	//		КонецЕсли;

	//	Исключение
	//		Сообщить("Ошибка чтения строки файла." + Строка + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
	//	КонецПопытки;
	//КонецЦикла;
	//ExcelПриложение.Quit();
	//
	//ОпределитьНоменклатуру();
	//
	//ПоказатьОповещениеПользователя ("Чтение файла завершено");
	//-- перенесено в ПрочитатьФайлExcel
	
КонецПроцедуры

//++ №14526
&НаКлиенте
Процедура ПослеПомещенияФайлаВоВременноеХранилище(Успешно, АдресВХранилище, ВыбранноеИмяФайла, ДопПараметры) Экспорт
	
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьФайлExcel(АдресВХранилище);
	
	ПоказатьОповещениеПользователя ("Чтение файла завершено");
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлExcel(АдресВХранилище)
	
	РасширениеФайла = Сред(ПутьКФайлу, СтрНайти(ПутьКФайлу, ".", НаправлениеПоиска.СКонца)+1);
	ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла(РасширениеФайла);
	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХранилище);
	ДвоичныеДанныеФайла.Записать(ПутьКФайлуНаСервере);
	
	ТабДокИзФайла = новый ТабличныйДокумент;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ТабДокИзФайла.Прочитать(ПутьКФайлуНаСервере, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщить("Не удалось прочитать файл Excel: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
	НачальнаяСтрока = ?(НачСтр = 0, 1, НачСтр);
	КоличествоСтрок = ТабДокИзФайла.ПолучитьРазмерОбластиДанныхПоВертикали();
	
	Для Строка = НачальнаяСтрока По КоличествоСтрок Цикл
		Попытка
			ЗагружаемоеНаименование = ?(НомерКолонкиНаименование = 0, 	"", ЗначениеИзОбласти(ТабДокИзФайла, Строка, НомерКолонкиНаименование));
			ЗагружаемыйАртикул 		= ?(НомерКолонкиАртикул = 0, 		"", ЗначениеИзОбласти(ТабДокИзФайла, Строка, НомерКолонкиАртикул));
			ЗагружаемыйКод 			= ?(НомерКолонкиКод = 0, 			"", ЗначениеИзОбласти(ТабДокИзФайла, Строка, НомерКолонкиКод));
			ЗагружаемыйШтрихкод 	= ?(НомерКолонкиШтрихкод = 0, 		"", ЗначениеИзОбласти(ТабДокИзФайла, Строка, НомерКолонкиШтрихкод));
			
			Если ПустаяСтрока(ЗагружаемоеНаименование) И ПустаяСтрока(ЗагружаемыйАртикул)
				И ПустаяСтрока(ЗагружаемыйКод) И ПустаяСтрока(ЗагружаемыйШтрихкод) Тогда
				Продолжить;
			КонецЕсли;
			 
			Стр = ТабЗнач.Добавить();
			Стр.Наименование = ЗагружаемоеНаименование;
			Стр.ЗагружаемыйАртикул = ЗагружаемыйАртикул;
			Стр.ЗагружаемыйКод = ЗагружаемыйКод;
			Стр.ЗагружаемыйШтрихкод = ЗагружаемыйШтрихкод;
			
			Стр.Характеристика = ?(НомерКолонкиХарактеристика = 0, 	"", ЗначениеИзОбласти(ТабДокИзФайла, Строка, НомерКолонкиХарактеристика));
			
			Стр.ЗагружаемаяЕдиницаИзмерения = ?(НомерКолонкиЕдИзм = 0, 	"", ЗначениеИзОбласти(ТабДокИзФайла, Строка, НомерКолонкиЕдИзм));
			
			Стр.Количество = ?(НомерКолонкиКоличество = 0, 1, ЗначениеИзОбласти(ТабДокИзФайла, Строка, НомерКолонкиКоличество));
			Стр.Цена = ?(НомерКолонкиЦена = 0, 0, ЗначениеИзОбласти(ТабДокИзФайла, Строка, НомерКолонкиЦена));
			Стр.Сумма = ?(НомерКолонкиСумма = 0, 0, ЗначениеИзОбласти(ТабДокИзФайла, Строка, НомерКолонкиСумма));
			
			Если Стр.Цена = 0 И Стр.Сумма > 0 И Стр.Количество <> 0 Тогда
				Стр.Цена = Стр.Сумма / Стр.Количество;
			КонецЕсли;
			Если Стр.Цена > 0 И Стр.Сумма = 0 И Стр.Количество <> 0 И ИспользоватьСумму Тогда
				Стр.Сумма = Стр.Цена * Стр.Количество;
			КонецЕсли;

		Исключение
			Сообщить("Ошибка чтения строки файла: " + Строка + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Внимание);
		КонецПопытки;
	КонецЦикла;
	
	ОпределитьНоменклатуру();
	
КонецПроцедуры

&НаСервере
Функция ЗначениеИзОбласти(ТабДокИзФайла, НомерСтроки, НомерКолонки)
	
	Возврат СокрЛП(ТабДокИзФайла.Область("R" + Формат(НомерСтроки, "ЧГ=") +"C" + Формат(НомерКолонки, "ЧГ=")).Текст);
	
КонецФункции
//-- №1426
	
&НаСервере
Процедура ОпределитьНоменклатуру()
	
	Для Каждого ТекущаяСтрока Из ТабЗнач Цикл
		Если ТекущаяСтрока.Номенклатура.Пустая() И НЕ ПустаяСтрока(ТекущаяСтрока.ЗагружаемыйАртикул) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	НЕ Номенклатура.ЭтоГруппа
			|	И Номенклатура.Артикул = &Артикул";
			Запрос.УстановитьПараметр("Артикул",ТекущаяСтрока.ЗагружаемыйАртикул);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекущаяСтрока.Номенклатура = Выборка.Ссылка;
			КонецЕсли;	
		КонецЕсли;
		
		Если ТекущаяСтрока.Номенклатура.Пустая() И НЕ ПустаяСтрока(ТекущаяСтрока.ЗагружаемыйКод) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	НЕ Номенклатура.ЭтоГруппа
			|	И Номенклатура.Код = &Код";
			Запрос.УстановитьПараметр("Код", ТекущаяСтрока.ЗагружаемыйКод);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекущаяСтрока.Номенклатура = Выборка.Ссылка;
			КонецЕсли;	
		КонецЕсли;
		
		Если ТекущаяСтрока.Номенклатура.Пустая() И НЕ ПустаяСтрока(ТекущаяСтрока.ЗагружаемыйШтрихкод) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ШтрихкодыНоменклатуры.Номенклатура КАК Ссылка,
			|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
			|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
			Запрос.УстановитьПараметр("Штрихкод", ТекущаяСтрока.ЗагружаемыйШтрихкод);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекущаяСтрока.Номенклатура = Выборка.Ссылка;
				ТекущаяСтрока.ХарактеристикаНоменклатуры = Выборка.Характеристика;
				ТекущаяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			КонецЕсли;	
		КонецЕсли;
		
		Если ТекущаяСтрока.Номенклатура.Пустая() И НЕ ПустаяСтрока(ТекущаяСтрока.Наименование) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	НЕ Номенклатура.ЭтоГруппа
			|	И Номенклатура.Наименование = &Наименование";
			Запрос.УстановитьПараметр("Наименование", ТекущаяСтрока.Наименование);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекущаяСтрока.Номенклатура = Выборка.Ссылка;
			КонецЕсли;	
		КонецЕсли;
		
		Если ТекущаяСтрока.Номенклатура.Пустая() Тогда
			Сообщить("По данным для поиска в строке " + (ТабЗнач.Индекс(ТекущаяСтрока)+1) + " совпадений не найдено.");
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока.Отметка = Истина;
		
		// Нужно найти характеристику при наличии
		Если НЕ ПустаяСтрока(ТекущаяСтрока.Характеристика) И ТекущаяСтрока.ХарактеристикаНоменклатуры.Пустая() Тогда
			ТекущаяСтрока.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(ТекущаяСтрока.Характеристика, Истина,, ТекущаяСтрока.Номенклатура);
		КонецЕсли;
		
		ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
		Коэффициент = 1;
		Если НЕ ПустаяСтрока(ТекущаяСтрока.ЗагружаемаяЕдиницаИзмерения) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмерения) Тогда			
			ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ТекущаяСтрока.ЗагружаемаяЕдиницаИзмерения, Истина);			
			Если ЕдиницаИзмерения.Пустая() Тогда
				ЕдиницаИзмерения = Справочники.ЕдиницыИзмерений.НайтиПоНаименованию(ТекущаяСтрока.ЗагружаемаяЕдиницаИзмерения, Истина,, ТекущаяСтрока.Номенклатура);
				Если НЕ ЕдиницаИзмерения.Пустая() Тогда
					Коэффициент = ЕдиницаИзмерения.Коэффициент;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЕдиницаИзмерения.Пустая() Тогда
			ЕдиницаИзмерения = ТекущаяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;	
		КонецЕсли;
		ТекущаяСтрока.ЕдиницаИзмерения = ЕдиницаИзмерения;
		ТекущаяСтрока.Коэффициент = Коэффициент;
		
		СтруктураДанные = Новый Структура;
		СтруктураДанные.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
		СтруктураДанные = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураДанные, "СтатьяДоходов, СтатьяРасходов");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого ТекущаяСтрока Из ТабЗнач Цикл
		Если НЕ ТекущаяСтрока.Номенклатура.Пустая() Тогда
			ТекущаяСтрока.Отметка = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого ТекущаяСтрока Из ТабЗнач Цикл
		ТекущаяСтрока.Отметка = Ложь;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗначНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ТабЗнач.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтатьяДоходов, СтатьяРасходов");
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗначКоличествоПриИзменении(Элемент)
	
	Если ИспользоватьСумму Тогда
		ТекущаяСтрока = Элементы.ТабЗнач.ТекущиеДанные;
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, Ложь, Ложь, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗначЕдиницаИзмеренияПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТабЗнач.ТекущиеДанные;
	Если ТипЗнч(ТекущаяСтрока.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущаяСтрока.Коэффициент = 1;
	Иначе
		ТекущаяСтрока.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ТекущаяСтрока.ЕдиницаИзмерения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗначЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.ТабЗнач.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(ТекущаяСтрока.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗначЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.ТабЗнач.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущаяСтрока.Коэффициент = 1;
	Иначе
		ТекущаяСтрока.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТабЗначЦенаПриИзменении(Элемент)
	
	Если ИспользоватьСумму Тогда
		ТекущаяСтрока = Элементы.ТабЗнач.ТекущиеДанные;
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, Ложь, Ложь, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЗначСуммаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТабЗнач.ТекущиеДанные;
	Если НЕ ТекущаяСтрока.Количество = 0 Тогда
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТовары(Команда)
	
	Перем СтруктураВыбора;
	
	Для Каждого ТекущаяСтрока Из ТабЗнач Цикл
		Если ТекущаяСтрока.Отметка И ТекущаяСтрока.Номенклатура.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По данным для поиска в строке " + (ТабЗнач.Индекс(ТекущаяСтрока)+1) + " совпадений не найдено.");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Закрыть();
	СтруктураВыбора = Новый Структура();
	СтруктураВыбора.Вставить("АдресТоваровВХранилище", ПоместитьТоварыВХранилище());
	ОповеститьОВыборе(СтруктураВыбора);			
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТоварыВХранилище()
	
	ТоварыДляПереноса = ТабЗнач.Выгрузить(, "Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, Цена, Сумма, СтатьяДоходов, СтатьяРасходов");
	ТоварыДляПереноса.Очистить();
	
	Для Каждого ПодобранныйТовар Из ТабЗнач Цикл
		Если НЕ ПодобранныйТовар.Отметка Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИспользоватьСумму Тогда
			ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ПодобранныйТовар, Ложь, Ложь, Ложь);
		КонецЕсли;
		
		НоваяСтрока = ТоварыДляПереноса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодобранныйТовар);
	КонецЦикла;			
	
	Возврат ПоместитьВоВременноеХранилище(ТоварыДляПереноса);
	
КонецФункции
